{
  "backend/main.mo": "Defines an empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Contains feature-to-file mappings and metadata describing implemented frontend features and related components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of various frontend source files and their responsibilities.",
  "frontend/index.css": "Tailwind base styles plus custom CSS variables for light/dark themes and global background/foreground styling.",
  "frontend/index.html": "Root HTML file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Top-level React component that renders the Slideshow inside a full-screen background container.",
  "frontend/src/components/DrawNameCanvas.tsx": "Freehand drawing canvas component with resize handling and clear functionality exposed via a ref.",
  "frontend/src/components/Ending3DModelSlide.tsx": "Final slide UI combining a drawing canvas, text input, model resolution logic, and 3D model display with SFX support.",
  "frontend/src/components/EndingGameSlide.tsx": "Placeholder file for the old heart-collector mini‑game; currently contains no code in this snapshot.",
  "frontend/src/components/ModelViewer3D.tsx": "3D model viewer using React Three Fiber with lighting, environment, orbit controls, and a suspense fallback.",
  "frontend/src/components/MusicControls.tsx": "UI panel for toggling music and sound effects and adjusting volume using local audio settings.",
  "frontend/src/components/ShayariSlide.tsx": "Renders a shayari poem over a styled background image with animated text lines.",
  "frontend/src/components/SlideIndicator.tsx": "Renders slide progress dots and a numeric counter based on current and total slides.",
  "frontend/src/components/Slideshow.tsx": "Controls slide navigation, background selection, audio playback, and swipe handling for the slideshow.",
  "frontend/src/components/TeddyGameSlide.tsx": "Empty placeholder file for a future teddy game slide component.",
  "frontend/src/data/shayari.ts": "Exports an array of 4-line shayari poems for slideshow content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useFreehandCanvas.ts": "Provides drawing logic for a freehand canvas, including stroke handling and clearing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks for managing Internet Identity login, persistence, and status.",
  "frontend/src/hooks/useLocalAudioSettings.ts": "Manages music and SFX settings with localStorage persistence.",
  "frontend/src/hooks/useQueries.ts": "Stub hook returning an empty object because no backend queries are used.",
  "frontend/src/hooks/useSwipeNavigation.ts": "Adds left/right swipe listeners to trigger navigation callbacks on a referenced element.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines a romantic-themed color palette and animations.",
  "frontend/src/lib/modelCatalog.ts": "Maps input names and aliases to local 3D model files and provides lookup helpers.",
  "frontend/src/lib/randomNoRepeat.ts": "Generates a function that returns random items without immediate repeats.",
  "frontend/src/lib/sfxEngine.ts": "Implements a lightweight Web Audio–based SFX engine providing navigation, tap, and completion sounds with lazy initialization.",
  "frontend/src/lib/speak.ts": "Provides text-to-speech utilities using the Web Speech API, including speaking with options and stopping speech.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, feature requirements, architectural notes, and current implementation state for the romantic slideshow app."
}