{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Base Tailwind setup and OKLCH theme variables with light/dark palettes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component rendering the Slideshow inside a full‑height container.",
  "frontend/src/components/EndingGameSlide.tsx": "Heart‑collecting mini‑game where tapping spawns animated hearts and triggers a completion message at 50 points.",
  "frontend/src/components/MusicControls.tsx": "Music enable/disable switch and volume slider bound to local audio settings.",
  "frontend/src/components/ShayariSlide.tsx": "Displays a 4‑line shayari poem over a gradient‑overlaid background image.",
  "frontend/src/components/SlideIndicator.tsx": "Shows slide progress with animated dots and a numeric counter.",
  "frontend/src/components/Slideshow.tsx": "Controls slide navigation, swipe handling, background music, and renders shayari slides plus the ending mini‑game.",
  "frontend/src/components/TeddyGameSlide.tsx": "Placeholder file with no content.",
  "frontend/src/data/shayari.ts": "Defines the Shayari type and exports seven 4‑line romantic poems.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and client setup.",
  "frontend/src/hooks/useLocalAudioSettings.ts": "Manages local audio enable/volume settings with persistence in localStorage.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning no queries since all data is local.",
  "frontend/src/hooks/useSwipeNavigation.ts": "Adds touch swipe detection on an element to trigger left/right navigation callbacks.",
  "frontend/src/index.css": "Tailwind base styles plus custom romantic theme colors, typography, and animations.",
  "frontend/src/lib/randomNoRepeat.ts": "Utility that returns a function to pick random items without repeating the previous one.",
  "frontend/src/lib/speak.ts": "Wrapper for browser speech synthesis to speak text with optional voice settings.",
  "frontend/src/main.tsx": "App entry initializing React, query client, and Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "JSON describing the project’s current features, requirements, and architectural notes."
}