{
  "kind": "build_request",
  "title": "Add interactive music (sound effects) that reacts to user interactions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Add optional interactive music (client-side sound effects) that reacts to user interactions (taps/clicks and slide navigation) while keeping background music behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "ADD INTERACTIVE MUSIC TOO"
        ]
      },
      "acceptanceCriteria": [
        "Interactive sound effects are present and clearly triggered by user interactions (at minimum: tapping in the ending mini-game, and using Next/Previous navigation).",
        "Interactive sound effects do not start automatically without a user gesture (must comply with browser autoplay policies).",
        "Background music playback (Tum Hi Ho), its toggle, and volume control continue to work as they do now."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Extend the existing local audio settings and UI controls to support interactive sound effects as a separately configurable option (on/off) that is off by default and persists locally.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "ADD INTERACTIVE MUSIC TOO"
        ]
      },
      "acceptanceCriteria": [
        "The Music controls UI includes a distinct toggle for interactive sound effects with English labeling (e.g., \"Sound Effects\"), and this setting persists via localStorage.",
        "Sound effects are off by default for new users (no prior localStorage settings).",
        "When sound effects are disabled, no interactive SFX play anywhere in the app.",
        "Sound effects loudness respects the existing volume setting (or, if a separate SFX volume is added, it persists locally and has an English label)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Make the ending mini-game’s sound effects feel responsive and progressive: play a pleasant, short sound on each tap that varies subtly (e.g., pitch/notes) and play a distinct completion sound when the goal is reached.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "ADD INTERACTIVE MUSIC TOO"
        ]
      },
      "acceptanceCriteria": [
        "Each valid tap in the EndingGameSlide triggers a short sound effect; consecutive taps vary subtly so the audio feels interactive rather than repetitive.",
        "When the completion state is reached, a distinct completion sound effect plays once.",
        "No sound effects are triggered when the game is complete and the user taps (unless they press \"Play Again\")."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not modify any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Do not add new backend canisters/services; keep all changes within the existing React frontend and optional static assets."
  ],
  "nonGoals": [
    "Do not change the shayari content or slide count.",
    "Do not add third-party audio/streaming services or external APIs.",
    "Do not introduce real-time networking features (e.g., WebSockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}