{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Interactive sound effects reacting to navigation and ending mini-game taps",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Add optional client-side interactive sound effects for slide navigation and user interactions without changing existing background music behavior.",
      "acceptanceCriteria": [
        "Interactive sound effects are present and clearly triggered by user interactions (at minimum: tapping in the ending mini-game, and using Next/Previous navigation).",
        "Interactive sound effects do not start automatically without a user gesture (must comply with browser autoplay policies).",
        "Background music playback (Tum Hi Ho), its toggle, and volume control continue to work as they do now."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/sfxEngine.ts",
          "operation": "create",
          "description": "Implement a lightweight, client-only SFX engine (Web Audio API tone-based or equivalent) that lazily initializes on first user-gesture playback, supports short sounds for navigation/taps/completion, and accepts (enabled, volume) to ensure SFX never play when disabled and respect the existing volume setting."
        },
        {
          "path": "frontend/src/components/Slideshow.tsx",
          "operation": "modify",
          "description": "Wire interactive SFX into Next/Previous navigation actions (button clicks and swipe-triggered navigation) by invoking the SFX engine only when the SFX setting is enabled; do not alter existing background music initialization, toggle, retry-on-gesture logic, or volume behavior."
        },
        {
          "path": "frontend/src/components/EndingGameSlide.tsx",
          "operation": "modify",
          "description": "Trigger tap SFX from the existing tap/click handler in the ending mini-game using the shared SFX engine, ensuring sounds only occur as a direct result of user gestures and are gated by the SFX setting."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Extend local audio settings and Music controls UI to include a separate, persisted Sound Effects toggle that is off by default and respects existing volume.",
      "acceptanceCriteria": [
        "The Music controls UI includes a distinct toggle for interactive sound effects with English labeling (e.g., \"Sound Effects\"), and this setting persists via localStorage.",
        "Sound effects are off by default for new users (no prior localStorage settings).",
        "When sound effects are disabled, no interactive SFX play anywhere in the app.",
        "Sound effects loudness respects the existing volume setting (or, if a separate SFX volume is added, it persists locally and has an English label)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLocalAudioSettings.ts",
          "operation": "modify",
          "description": "Add a persisted local setting for interactive sound effects (e.g., sfxEnabled) that defaults to false when no localStorage value exists, and expose getters/setters alongside the existing background music enabled/volume settings."
        },
        {
          "path": "frontend/src/components/MusicControls.tsx",
          "operation": "modify",
          "description": "Add a distinct, English-labeled toggle control (e.g., \"Sound Effects\") bound to the new local SFX setting (off by default); compose existing UI patterns without editing files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Slideshow.tsx",
          "operation": "modify",
          "description": "Consume the new SFX setting from useLocalAudioSettings and pass (sfxEnabled, volume) into the SFX engine calls so SFX are globally gated and loudness follows the existing volume."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Make ending mini-game sound effects responsive and progressive with subtle variation per tap and a distinct one-time completion sound.",
      "acceptanceCriteria": [
        "Each valid tap in the EndingGameSlide triggers a short sound effect; consecutive taps vary subtly so the audio feels interactive rather than repetitive.",
        "When the completion state is reached, a distinct completion sound effect plays once.",
        "No sound effects are triggered when the game is complete and the user taps (unless they press \"Play Again\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/sfxEngine.ts",
          "operation": "modify",
          "description": "Add progressive tap SFX support with subtle variation (e.g., cycling/picking from a small set of notes without immediate repeats, light pitch variation) and a distinct completion sound; ensure completion sound is designed to be triggered once per completion."
        },
        {
          "path": "frontend/src/components/EndingGameSlide.tsx",
          "operation": "modify",
          "description": "Invoke the tap SFX for each valid tap while the game is not complete; trigger the distinct completion SFX exactly once when the completion state is reached; ensure taps after completion do not play SFX, and that \"Play Again\" reset re-enables tap SFX behavior for the next run. (Continue using the existing shadcn-ui Button without modifying frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}